{
    "class_name": "Model", 
    "keras_version": "2.0.8", 
    "config": {
        "layers": [
            {
                "class_name": "InputLayer", 
                "inbound_nodes": [], 
                "config": {
                    "dtype": "float32", 
                    "batch_input_shape": [
                        null, 
                        784
                    ], 
                    "name": "input_6", 
                    "sparse": false
                }, 
                "name": "input_6"
            }, 
            {
                "class_name": "Dense", 
                "inbound_nodes": [
                    [
                        [
                            "input_6", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "Constant", 
                        "config": {
                            "value": 0
                        }
                    }, 
                    "name": "dense_16", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "kernel_regularizer": null, 
                    "bias_initializer": {
                        "class_name": "Constant", 
                        "config": {
                            "value": 0
                        }
                    }, 
                    "units": 512, 
                    "use_bias": true, 
                    "activity_regularizer": null
                }, 
                "name": "dense_16"
            }, 
            {
                "class_name": "Dropout", 
                "inbound_nodes": [
                    [
                        [
                            "dense_16", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "rate": 0.5, 
                    "trainable": true, 
                    "name": "dropout_11"
                }, 
                "name": "dropout_11"
            }, 
            {
                "class_name": "Dense", 
                "inbound_nodes": [
                    [
                        [
                            "dropout_11", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "Constant", 
                        "config": {
                            "value": 0
                        }
                    }, 
                    "name": "dense_17", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "kernel_regularizer": null, 
                    "bias_initializer": {
                        "class_name": "Constant", 
                        "config": {
                            "value": 0
                        }
                    }, 
                    "units": 10, 
                    "use_bias": true, 
                    "activity_regularizer": null
                }, 
                "name": "dense_17"
            }, 
            {
                "class_name": "Dropout", 
                "inbound_nodes": [
                    [
                        [
                            "dense_17", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "rate": 0.5, 
                    "trainable": true, 
                    "name": "dropout_12"
                }, 
                "name": "dropout_12"
            }, 
            {
                "class_name": "Dense", 
                "inbound_nodes": [
                    [
                        [
                            "dropout_12", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "Constant", 
                        "config": {
                            "value": 0
                        }
                    }, 
                    "name": "dense_18", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "kernel_regularizer": null, 
                    "bias_initializer": {
                        "class_name": "Constant", 
                        "config": {
                            "value": 0
                        }
                    }, 
                    "units": 10, 
                    "use_bias": true, 
                    "activity_regularizer": null
                }, 
                "name": "dense_18"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "dense_18", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "softmax", 
                    "trainable": true, 
                    "name": "activation_6"
                }, 
                "name": "activation_6"
            }
        ], 
        "input_layers": [
            [
                "input_6", 
                0, 
                0
            ]
        ], 
        "name": "Untitled", 
        "output_layers": [
            [
                "activation_6", 
                0, 
                0
            ]
        ]
    }, 
    "backend": "tensorflow"
}